{"kinks":{"31":{"group":"Age Related","items":[{"kink_id":620,"name":"Age Differences","description":"Adult characters with significant gaps in the ages between them (does not imply underage)."},{"kink_id":196,"name":"Ageplay","description":"Refers to scenes in which one or both players portrays a significantly underage character, possibly including sexual interactions."},{"kink_id":622,"name":"Age Progression","description":"Scenes in which a character&rsquo;s age progresses, often focusing on their physical development but may incorporate mental aspects."},{"kink_id":621,"name":"Age Regression","description":"Scenes in which a character becomes younger, physically and sometimes mentally."},{"kink_id":207,"name":"Underage Characters","description":"A situation in which at least one character will be underage, typically younger than 15 but definitely under 18."}]},"32":{"group":"Anal Sex &amp; Play","items":[{"kink_id":38,"name":"Anal Fisting","description":"The act of inserting one&#039;s hand(s) and \/ or arm(s) into one&#039;s partner&#039;s anus, or being the recipient of such acts."},{"kink_id":511,"name":"Anal Prolapse","description":"Where insides of the anus are pulled out by force (unnatural means, such as a cream, liquid or suction method, or internal massage) or naturally (either by a cock, dildo, or pushing)."},{"kink_id":137,"name":"Anal Sex (Giving)","description":"The act of anally penetrating a partner."},{"kink_id":157,"name":"Anal Sex (Receiving)","description":"The act of being anally penetrated."},{"kink_id":42,"name":"Anal Training","description":"Engaging in the use of the various anatomy of a character&#039;s anus to otherwise prepare and \/ or acclimate the character to an insertion, the size of which the character would not otherwise be comfortable taking."},{"kink_id":45,"name":"Anal Virginity","description":"Engaging in anal sex with a character who has never been anally penetrated before, or being anally penetrated while playing a character that has never been penetrated before."},{"kink_id":30,"name":"Enemas","description":"The application of a liquid, typically warm water or a body fluid, to the intestines of a character, often to clean them out, but sometimes as a form of discipline or sexual gratification, or receiving such actions; might imply a form of administration other than phallic penetration."},{"kink_id":623,"name":"Fingering (Anal)","description":"The act of using one&rsquo;s fingers to stimulate another character anally, or receiving such actions, in order to induce sexual pleasure."},{"kink_id":498,"name":"Gaping (Anal)","description":"Stretching the anus during penetration, to the point that it stays open for a period of time."},{"kink_id":525,"name":"Pegging","description":"Anal penetration with a strap-on."},{"kink_id":624,"name":"Prostate Play","description":"The act of stimulating the prostate, generally rectally with fingers or toys."},{"kink_id":163,"name":"Rimming (Giving)","description":"The act of giving oral stimulation to a partner&#039;s anus, by the means of licking and \/ or penetrating the recipient&#039;s anus with the tongue."},{"kink_id":16,"name":"Rimming (Receiving)","description":"The act of receiving oral stimulation to one&#039;s anus, by the means of licking and \/ or having one&#039;s anus penetrated by the tongue."}]},"43":{"group":"BDSM","items":[{"kink_id":681,"name":"Aftercare","description":"Comforting care and maintenance carried out between two characters after a particularly rigorous experience, such as after BDSM scenes or heavy \/ harsh exchanges. May consist of talking, cuddling, and various forms of pampering."},{"kink_id":360,"name":"Apparatuses","description":"The use of complex objects with moving parts in order to bondage, immobilize or otherwise sexually gratify and \/ or incapacitate a character, in the sexual context of an RP."},{"kink_id":47,"name":"Blindfolds","description":"The use of blindfolds or other objects to obscure the vision of at least one character in a sexual context."},{"kink_id":17,"name":"Caging","description":"The act of placing another character in a cage, or being placed in a cage, or other confining, device."},{"kink_id":521,"name":"Coiling","description":"The act of becoming entwined, held or hugged in the grasp of a long tail, coils of a snake, serpent, or other long-bodied creature."},{"kink_id":683,"name":"Crying","description":"The involvement and presence of someone crying or making a character do so, usually as the result of pain or actions carried out against them (which may or may not stimulate arousal from the inflictor)."},{"kink_id":31,"name":"Electric Toys","description":"The use of sex toys that carry an electrical current; sometimes painful."},{"kink_id":147,"name":"Flogging \/ Whipping","description":"The use of toys being employed against another character, particularly referring to contact play involving whips of any type, riding crops, paddles, or flogs."},{"kink_id":135,"name":"Gags","description":"The act of placing and lodging an object in another character&#039;s mouth to force them to breathe through their nose, as well as creating the inability to speak, or receiving such actions."},{"kink_id":362,"name":"Hand Cuffs","description":"The use of hand cuffs to partially immobilize a character during an RP, or to restrain a character to an object."},{"kink_id":133,"name":"Heavy \/ Extreme Bondage","description":"The use of bondage that is extreme in either the position in which it causes the bound character to be in, the duration for which the character will be in bondage, the level of discomfort caused by the bondage or the amount of immobilization that will occur due to the bondage."},{"kink_id":128,"name":"Immobilization (Bondage)","description":"Engaging in an RP in which at least one character will be physically immobilized, typical by heavy bondage or mummification from BDSM, but may be from other methods like entrapment or suppression."},{"kink_id":116,"name":"Leash &amp; Collar","description":"Engaging in an RP in which a character will be adorned with a collar that will be attached to a leash."},{"kink_id":114,"name":"Light \/ Medium Bondage","description":"The use of bondage that is mild or moderate in either the position in which it causes the bound character to be in, the duration for which the character will be in bondage, the level of discomfort caused by the bondage or the amount of immobilization that will occur due to the bondage."},{"kink_id":107,"name":"Orgasm Control \/ Denial","description":"Refers to the dominant(s) being in control of when the submissive(s) achieve(s) orgasm, either by physical means or by command; typically involves domination and \/ or excessive teasing and edging; orgasm may be completely denied"},{"kink_id":186,"name":"Pleasure Control \/ Denial","description":"Engaging in an RP in which one character is in a position to administer or withhold any form of physical, sexual or psychological pleasure to another character; pleasure may be completely denied."},{"kink_id":682,"name":"Sensory Deprivation","description":"Expresses an interest in the deliberate reduction or removal of stimuli from one or more of the senses. May include devices such as blindfolds, hoods, or earmuffs to cut off sight and hearing, or more complex devices that can cut off a character&rsquo;s sense of smell, touch, taste, heat sense, or gravity."},{"kink_id":367,"name":"Suspension Play","description":"Engaging in an RP that includes suspension apparatuses and \/ or rope toys, which typically will suspend one character above the bed or floor; often uncomfortable."}]},"40":{"group":"Body Worship &amp; Play","items":[{"kink_id":660,"name":"Armpits","description":"Play revolving around the armpit region."},{"kink_id":294,"name":"Ass Worship","description":"Gratuitous acknowledgment of one&#039;s partner&#039;s ass or buttocks, either verbal and \/ or physical, or receiving such actions."},{"kink_id":671,"name":"Belly Fucking","description":"The act of placing one&#039;s penis into \/ against a character&#039;s belly (may be through the navel, making use of significant body fat, or other means) and achieving climax due to the friction thereof, or receiving such actions."},{"kink_id":661,"name":"Belly Play","description":"Play that revolves around the stomach \/ midsection region, be it massaging, groping, squeezing, or otherwise."},{"kink_id":670,"name":"Body Writing","description":"The act of writing, drawing, or painting various (typically sexual or degrading) words or pictures onto a character&rsquo;s body."},{"kink_id":14,"name":"Breast \/ Nipple Play","description":"Sexual stimulation of the breasts and \/ or nipples."},{"kink_id":12,"name":"Breast \/ Nipple Worship","description":"Gratuitous acknowledgement of one&#039;s partner&#039;s chest or nipples, either verbal and \/ or physical, or receiving such actions."},{"kink_id":411,"name":"Breast Smothering","description":"The act of smothering a character using one&#039;s breasts, making it hard to breathe."},{"kink_id":576,"name":"Cuddling","description":"Characters showing affection through hugging, snuggling, and other forms of physical closeness."},{"kink_id":563,"name":"Ear Play","description":"Interest in roleplay where ears play an important role. This can involve suckling, caressing, breathing \/ whispering into, pulling them, or any other kind of interaction focusing on the ears."},{"kink_id":662,"name":"Fat Play","description":"Play that revolves around a character&#039;s body fat in one form or another. Typically in regions such as the belly, ass, chest, thighs, etc."},{"kink_id":663,"name":"Footjobs","description":"A sexual practice that involves one&#039;s feet being rubbed on a partner in order to induce sexual excitement, stimulation, or orgasm."},{"kink_id":50,"name":"Foot Play","description":"The act of incorporating the feet or feet paws into the sexual context of an RP, including but not limited to the worshiping of feet, receiving sexual gratification from the sight or feel of feet and \/ or humping feet, sometimes to the point of orgasm."},{"kink_id":138,"name":"Handjobs","description":"The act of using one&rsquo;s hand to stimulate another&rsquo;s cock, or receiving such actions, in order to induce sexual pleasure, commonly resulting in orgasm."},{"kink_id":664,"name":"Hand Play","description":"Play that revolves around the hands."},{"kink_id":526,"name":"Hotdogging","description":"The act of placing a penis between the ass cheeks and pressing them against it, sliding it between them in order to reach sexual satisfaction."},{"kink_id":668,"name":"Hyper Lactation","description":"Expresses an interest in lactation that is exceptionally excessive and in unrealistic proportions."},{"kink_id":665,"name":"Intercrural Sex","description":"A form of non-penetrative sex done by inserting a cock between one&rsquo;s thighs in order to achieve orgasm."},{"kink_id":119,"name":"Lactation","description":"The act of producing milk from one&#039;s breasts, or engaging in sex with a character that produces milk from one&#039;s breasts, typically in response to sexual stimulation, and any play that will emanate thereof."},{"kink_id":666,"name":"Massages","description":"The act of treating the body by rubbing, kneading, patting, or similar in order to stimulate circulation, increase suppleness, relieve tension, or pamper an individual."},{"kink_id":110,"name":"Masturbation","description":"The act of stimulating oneself sexually, usually utilizing physical contact from the hands or fingers to the genitals."},{"kink_id":293,"name":"Muscle Worship","description":"Gratuitous acknowledgment of someone&#039;s muscular physique, either verbal or physical."},{"kink_id":97,"name":"Navel Play","description":"Engaging in sexual acts involving pleasure derived from a character&#039;s bellybutton; often refers to licking or tonguing of the navel."},{"kink_id":669,"name":"Nursing","description":"The act of feeding a character by having them suckle a lactating breast, or receiving such actions."},{"kink_id":667,"name":"Paw Play","description":"Expresses an interest in play surrounding paws (hand or feet pads), generally of anthropomorphic characters."},{"kink_id":75,"name":"Titfucking","description":"The act of placing one&#039;s penis in between a pair of breasts and achieving climax due to the friction thereof, or receiving such actions."}]},"28":{"group":"Character Preferences","items":[{"kink_id":585,"name":"Amputees","description":"Characters that have had limbs amputated, or are missing a limb \/ limbs."},{"kink_id":329,"name":"Anatomically Correct","description":"Expresses an interest in characters that have realistic and average body proportions."},{"kink_id":586,"name":"Androgyny","description":"Gender ambiguity in appearance. May also be found in fashion, voice, gender identity, sexual identity, or lifestyle."},{"kink_id":332,"name":"Animal Anatomy","description":"Expresses an interest in characters with penises or vaginas that are exact replicas of those of real animals."},{"kink_id":587,"name":"Anthro Characters","description":"Characters that are anthropomorphic in nature, typically defined as an object or animal species with human characteristics."},{"kink_id":44,"name":"Barbed Cocks","description":"Expresses an interest in penises with barbed heads; typically feline."},{"kink_id":588,"name":"Body Hair","description":"Expresses in interest in characters that have body hair. Generally denotes hair on places like a character&rsquo;s chest, arms, legs, armpits, stomach trail, etc."},{"kink_id":589,"name":"Canon Characters","description":"Expressing an interest in characters from established &ldquo;canonized&rdquo; media, derived from official publicized content such as movies, video games, TV, comics, and so on."},{"kink_id":458,"name":"Chubby","description":"Expresses an interest in characters that are well-rounded and pudgy, with a little more extra weight than average but not necessarily fat."},{"kink_id":246,"name":"Cut Cocks","description":"Expresses an interest in circumcised penises."},{"kink_id":605,"name":"Disabilities","description":"Expresses an interest in characters with disabilities in some way, such as deafness, blindness, paraplegia, or other impairments that may be cognitive, developmental, intellectual, mental, physical, sensory, or some combination of these."},{"kink_id":204,"name":"Exotic Cocks","description":"Expresses an interest in unusually shaped or accessorized penises."},{"kink_id":590,"name":"Facial Hair \/ Beards","description":"Expresses an interest in characters sporting facial hair in some manner, which can extend anywhere from scruffy stubble to full beards."},{"kink_id":591,"name":"Fangs \/ Sharp Teeth","description":"Expresses an interest in having or playing with a character that has sharp pointed fangs and\/or teeth."},{"kink_id":531,"name":"Femboys","description":"Effeminate, girly males."},{"kink_id":592,"name":"Femininity","description":"An interest in characters that tend to be traditionally feminine in appearance and \/ or personality."},{"kink_id":136,"name":"Genital \/ Nipple Piercings","description":"Engaging in an RP in which at least one character has piercings that are located on the nipples or sexual areas of the body; typically cock or labia piercings."},{"kink_id":278,"name":"Hirsute","description":"Refers to the preference for characters with excessive or pronounced hair; typically involves character that would otherwise not have hair to have hair, or for furry characters to have additional hair in areas such as but not limited to the pubis, armpits and chin, and often implies a denser or more wiry texture of hair."},{"kink_id":718,"name":"Horns","description":"A preference for characters that possess horns, regardless of the appropriateness of horns to the character&rsquo;s species."},{"kink_id":345,"name":"Human Cocks","description":"Expresses an interest in characters that have human shaped penises."},{"kink_id":595,"name":"Hyper Asses","description":"Expresses an interest in asses that are incredibly large and disproportional to their body size."},{"kink_id":233,"name":"Hyper Balls","description":"Expresses an interest in balls that are exceptionally large."},{"kink_id":594,"name":"Hyper Breasts","description":"Expresses an interest in breasts that are incredibly disproportionate to their body size."},{"kink_id":60,"name":"Hyper Cocks","description":"Expresses an interest in large penises incredibly disproportionate to their body size."},{"kink_id":377,"name":"Hyper Fat","description":"Expresses an interest in characters that are impossibly obese."},{"kink_id":376,"name":"Hyper Muscle","description":"Expresses an interest in characters that have an impossibly muscular physique."},{"kink_id":593,"name":"Hyper Vaginas","description":"Expresses an interest in vaginas that are exceptionally large, or with unrealistic proportions."},{"kink_id":378,"name":"Hyper-Voluptuous","description":"Expresses an interest in characters that have unrealistically large hips and buttocks."},{"kink_id":484,"name":"Intelligent Characters","description":"Exhibits a preference for characters that have particularly high levels of intelligence, wit, cunning and manipulation skills."},{"kink_id":211,"name":"Knotted Cocks","description":"Expresses an interest in penises with a knot."},{"kink_id":500,"name":"Large Asses","description":"Specifies an interest in characters with a larger than normal ass."},{"kink_id":488,"name":"Large Balls","description":"Expresses an interest in balls that are large."},{"kink_id":118,"name":"Large Breasts","description":"Expresses an interest in exceptionally large breasts."},{"kink_id":117,"name":"Large Cocks","description":"Expresses an interest in exceptionally large cocks."},{"kink_id":375,"name":"Large Tails","description":"Expresses an interest in exceptionally large or dense tails."},{"kink_id":596,"name":"Macro Asses","description":"Expresses an interest in impossibly large asses that are incredibly disproportionate to their body size."},{"kink_id":550,"name":"Macro Balls","description":"Expresses an interest in balls that are larger than their owner, with or without being proportionate to the owner&#039;s penis."},{"kink_id":91,"name":"Macro Breasts","description":"Expresses an interest in impossibly large breasts that are incredibly disproportionate to their body size."},{"kink_id":61,"name":"Macro Cocks","description":"Expresses an interest in penises that are taller and \/ or wider than its owner."},{"kink_id":285,"name":"Macrophilia","description":"Expresses an interest in characters that are incredibly and unrealistically tall."},{"kink_id":111,"name":"Magic Users","description":"RPs involving characters that are capable of performing magical or supernatural feats that may or may not be sexual in nature."},{"kink_id":597,"name":"Masculinity","description":"An interest in characters that tend to be traditionally masculine in appearance and \/ or personality."},{"kink_id":374,"name":"Mega Macro","description":"Expresses an interest in characters that are at least one mile tall."},{"kink_id":286,"name":"Microphilia","description":"Expresses an interest in characters that are impossibly and unrealistically small."},{"kink_id":598,"name":"Moobs","description":"Expresses an interest in male identifying characters that have significant breast tissue, typically known as gynecomastia."},{"kink_id":222,"name":"Multi Genitalia","description":"Expresses an interest in characters that have more than one set of external sex organs."},{"kink_id":463,"name":"Multiple Breasts","description":"Expresses an interest in characters that have more than one pair of breasts."},{"kink_id":287,"name":"Muscular Characters","description":"Expresses an interest in characters that are powerfully-built and \/ or athletic."},{"kink_id":105,"name":"Nonsexual Piercings","description":"Engaging in sex with a character who has piercings on parts of their body that are not of a sexual nature, such as but not limited to tongue, ears, nose, lips, bellybutton etc."},{"kink_id":109,"name":"Older Characters","description":"Expresses a preference for characters that are older than one&#039;s own."},{"kink_id":599,"name":"Original Characters","description":"Expressing an interest in characters that are of the player&rsquo;s own personalized creation (typically not from established publicized media)."},{"kink_id":336,"name":"Prehensile Cocks","description":"Expresses an interest in characters that have the ability to control the motion of their penises."},{"kink_id":564,"name":"Pubic Hair","description":"Expresses an interest in pubic hair, possibly in large or excessive quantities."},{"kink_id":382,"name":"Quadrupeds","description":"Characters that walk on four legs."},{"kink_id":348,"name":"Rubber \/ Elastic Characters","description":"Expresses an interest in characters who are composed of rubber, latex, or an otherwise elastic material."},{"kink_id":373,"name":"Sheaths","description":"Expresses an interest in characters that have a sheath."},{"kink_id":600,"name":"Shorter Characters","description":"An expressed interest in characters that are shorter than one&#039;s character."},{"kink_id":173,"name":"Size Differences (1-3 Feet)","description":"Engaging in an RP in which the height difference between any, two characters is between one and three feet."},{"kink_id":502,"name":"Size Differences (Micro \/ Macro)","description":"Engaging in an RP in which the height difference between any, two characters is extremely large."},{"kink_id":601,"name":"Skinny Characters","description":"Expresses an interest in characters that are rather thin or lank."},{"kink_id":584,"name":"Slime \/ Goo Characters","description":"Expresses an interest in characters who are composed of slime, goo, fluids, or similar viscous \/ semi-viscous substances."},{"kink_id":177,"name":"Small Breasts","description":"Expresses an interest in breasts that are particularly small, sometimes to the point of appearing absent."},{"kink_id":178,"name":"Small Cocks","description":"Expresses an interest in cocks that are smaller than five inches."},{"kink_id":616,"name":"Superheroes \/ Villains","description":"Characters that fit into the Superhero \/ Superhuman genre, set in a world of heroes and villains, where costumed crime fighters and individuals with superhuman powers exist."},{"kink_id":602,"name":"Tails","description":"A preference for characters that possess tails, regardless of the appropriateness of tails to the character&rsquo;s species."},{"kink_id":603,"name":"Taller Characters","description":"An expressed interest in characters that are taller than one&#039;s character."},{"kink_id":604,"name":"Tattoos \/ Body Art","description":"An interest in characters that have tattoos."},{"kink_id":72,"name":"Tentacles","description":"Engaging in an RP that involves self-sentient tentacles, or a character \/ entity with tentacle-like appendages. Often implies multiple penetration."},{"kink_id":532,"name":"Tomboys","description":"Females who behave or present themselves in a masculine manner."},{"kink_id":720,"name":"Toons","description":"Characters that are &ldquo;cartoony&rdquo; in nature, implying exaggerated design styles and anatomy as well toony physics and behaviors."},{"kink_id":354,"name":"Twinks","description":"Expresses an interest in male characters that are typically skinny \/ slim in build, having little or no body or facial hair, and described as conventionally attractive, but still present as masculine \/ male."},{"kink_id":426,"name":"Twins \/ Clones","description":"Expresses an interest in two or more characters who are identical, often siblings but not necessarily, who may or may not be played by the same player."},{"kink_id":468,"name":"Udders","description":"Expresses interest in characters with udders instead of, or in addition to, normal breasts."},{"kink_id":245,"name":"Uncut Cocks","description":"Expresses an interest in penises that have not been circumsized and have present foreskin."},{"kink_id":485,"name":"Unintelligent Characters","description":"Exhibits a preference for characters that exhibit below-average intelligence, often low enough to make them easy to manipulate; this includes everything from air-headed bimbos to large, animalistic brutes."},{"kink_id":183,"name":"Very Fat Characters","description":"Expresses an interest in characters that are exceptionally overweight or obese."},{"kink_id":85,"name":"Very Lithe Characters","description":"Expresses an interest in characters that are exceptionally thin or lank."},{"kink_id":84,"name":"Very Muscular Characters","description":"Expresses an interest in characters that are exceptionally muscular or toned."},{"kink_id":379,"name":"Voluptuousness","description":"Expresses an interest in characters with wider than average hips and large buttocks."},{"kink_id":480,"name":"Wings","description":"A preference for characters that possess wings, regardless of the appropriateness of wings to the character&#039;s species."},{"kink_id":197,"name":"Younger Characters","description":"Expresses a preference for characters that are younger than one&#039;s own."}]},"35":{"group":"Cock Play","items":[{"kink_id":264,"name":"Cock \/ Ball Smothering","description":"The act of smothering a character with a cock and \/ or balls, making it difficult to breathe."},{"kink_id":24,"name":"Cock \/ Balls Worship","description":"Gratuitous acknowledgment of one&#039;s partner&#039;s cock and \/ or balls, either verbal and \/ or physical, or receiving such actions; typically implies oral stimulation."},{"kink_id":390,"name":"Cock Fucking","description":"The act of inserting one&#039;s penis into another penis and thrusting into it as if it were a more traditional orifice."},{"kink_id":410,"name":"Cock Slapping","description":"The act of using one&#039;s penis to slap one&#039;s partner and \/ or being slapped by a penis, usually in order to humiliate or debase a bottom prior to or during fellatio."},{"kink_id":631,"name":"Cock Warming","description":"The act of slipping one&rsquo;s erection into a partner&rsquo;s body in order to keep warm, typically considered a more intimate and sexual means of spooning."},{"kink_id":506,"name":"Docking","description":"Phallic insertion into another person&#039;s sheath and \/ or foreskin."},{"kink_id":630,"name":"Flaccid Play","description":"Expresses an interest in play that involves a character&rsquo;s penis being flaccid. May involve handjobs or oral sex while flaccid, or attempting penetration in such a state."},{"kink_id":292,"name":"Foreskin Worship","description":"Gratuitous acknowledgment of one&#039;s partner&#039;s foreskin, either verbal and \/ or physical, or receiving such actions; typically implies oral stimulation."},{"kink_id":134,"name":"Frotting","description":"The act of at least two penises being ground against each other for sexual gratification."},{"kink_id":330,"name":"Sheath Play","description":"The act of stimulating or otherwise playing with the sheath of a character, typically through tonguing or fingering, or receiving such actions, or being sexually aroused by the scent, taste, or touch of a sheath."}]},"36":{"group":"Cum Related","items":[{"kink_id":194,"name":"Bukkake","description":"The act of a group of at least two people ejaculating directly onto the face and \/ or body of a single recipient, or receiving such actions."},{"kink_id":517,"name":"Creampie","description":"The act of orgasming into or onto an exposed, often gaping, orifice, or receiving such actions."},{"kink_id":632,"name":"Cum","description":"Sexual fluids, often generated from one&rsquo;s orgasm."},{"kink_id":351,"name":"Cum Bath","description":"The act of being treated physically with cum (typically in large amounts) such as having it rubbed into one&#039;s skin or fur, or literally bathing in it, or having one&#039;s semen used in such ways."},{"kink_id":63,"name":"Cum Enemas","description":"The act of performing an enema, the liquid being used in such being semen, or receiving such actions, often by means of an orgasm."},{"kink_id":195,"name":"Cum From Mouth \/ Nose","description":"The act of ejaculating with such force and \/ or by such a volume that the cum leaks and \/ or sprays from a characters mouth and \/ or nose, or receiving such actions."},{"kink_id":64,"name":"Cum Marking","description":"The act of cumming onto a bottom or submissive with the intent for the scent or sight of the cum to work as a proprietary mark, sometimes for extended or permanent periods of time, or receiving such actions."},{"kink_id":454,"name":"Cum Milking","description":"The act of collecting or milking the semen from at least one partner, typically done through manual or mechanical stimulation to the penis, or using stored semen as a sexual toy in an RP. Often involves machines and apparati."},{"kink_id":221,"name":"Cum on Clothes","description":"The act of ejaculating onto clothing or wearing clothing that has been ejaculated on, often in public and \/ or for extended periods of time."},{"kink_id":633,"name":"Cum Vomit","description":"The act of, or interest in, vomiting cum that has been recently ingested, typically in copious amounts but not necessarily."},{"kink_id":296,"name":"Excessive Precum","description":"Engaging in an RP in which a character produces a larger than average amount of precum; typically unrealistic."},{"kink_id":33,"name":"Excessive Semen","description":"Engaging in an RP in which a character produces a larger than average amount of semen; typically unrealistic."},{"kink_id":634,"name":"Felching","description":"The act of orally sucking semen out of a partner&#039;s anus or vagina."},{"kink_id":65,"name":"Hard Cum Facials","description":"The act of cumming onto someone&#039;s face with no regard for that person&#039;s well-being, typically cumming into their ears, onto their eyes, into their nostrils or hair etc., or receiving such action; implies an exceptionally large amount of semen."},{"kink_id":297,"name":"Heavily Excessive Precum","description":"Engaging in an RP in which a character, typically unrealistically endowed, produces exceptionally large volumes of precum, including but not limited to multiple gallons, and \/ or looses precum with exceptional force and consistency, often to the point of being comparable to urinating or further."},{"kink_id":56,"name":"Heavily Excessive Semen","description":"Engaging in an RP in which a character, typically unrealistically endowed, produces exceptionally large volumes of semen, including but not limited to multiple gallons, and \/ or looses semen with exceptional force and consistency, often to the point of being comparable to urinating or further."},{"kink_id":230,"name":"Internal Cumshots","description":"The act of ejaculating into another&#039;s body, or receiving such actions."},{"kink_id":441,"name":"Premature Ejaculation","description":"Expresses interest in at least one partner reaching orgasm very quickly; typically implies eagerness, excessive sensitivity and \/ or prolonged teasing."},{"kink_id":342,"name":"Realistic Cum","description":"Expresses a preference for engaging in an RP in which the volume and quality of sexual fluid is realistic."},{"kink_id":298,"name":"Shooting Precum","description":"Engaging in an RP in which a character spurts precum with exceptional force and consistency."},{"kink_id":192,"name":"Sloppy Seconds","description":"Engaging in an RP in which a character that has just been came in receives sex from a different partner in the same orifice without removing the previous top&#039;s semen."},{"kink_id":62,"name":"Snowballing","description":"The act of receiving cum into one&#039;s mouth transmitted from another person&#039;s mouth, or french kissing while sharing a load of cum between one anothers&#039; mouths."},{"kink_id":55,"name":"Soft Cum Facials","description":"The act of cumming directly onto one&#039;s face, typically into an open mouth or across the cheeks and \/ or lips, or receiving such actions."},{"kink_id":67,"name":"Swallowing Semen","description":"The act of orally consuming semen, either directly or indirectly from a penis."},{"kink_id":470,"name":"Thick \/ Sticky Cum","description":"A preference for characters&#039; semen to be particularly thick and \/ or viscous, often comparable to tar or glue."},{"kink_id":299,"name":"Unusual Semen","description":"A preference for a character&#039;s semen to have any number of unusual or atypical properties, often referring to taste, color, texture, scent and \/ or temperature."}]},"42":{"group":"Dom \/ Sub &amp; Psyche Play","items":[{"kink_id":257,"name":"Begging","description":"The self-abasing act of pleading, as a form of submission, being incorporated into an RP."},{"kink_id":23,"name":"Chastity","description":"Sexual abstinence, either willing or forced; this can include someone simply abstaining from sexual activity, or the wearing of a device that prevents it."},{"kink_id":25,"name":"Coercion \/ Blackmail","description":"Refers to the inclusion of Coercion and \/ or Blackmail in the context of the story arc of an RP, often in the form of a semi-consensual means of receiving goods, services, or sex from a partner."},{"kink_id":571,"name":"Corruption","description":"Refers to the loss of morality, characterized by a character starting pure and then becoming depraved in some way, typically ending with them being evil, slutty, or some combination of the two."},{"kink_id":10,"name":"Degradation","description":"A situation where one character will be purposefully degraded, usually as a means of lowering their self worth; typically in the context of guilt or BDSM."},{"kink_id":8,"name":"Dirty Talking","description":"The act of speaking in a typically explicit manner to provoke sexual stimulation from a participant, sometimes one&#039;s self; often in the context of seduction or foreplay."},{"kink_id":34,"name":"Discipline \/ Reinforcement","description":"The use of reinforcement (rewards and \/ or punishments) in order to train a submissive to obey the various commands of a master."},{"kink_id":437,"name":"Extreme Humiliation","description":"Engaging in an RP in which one character will purposefully be humiliated to the point (or attempted point) of intense, mental anguish and total loss of self-worth through sexual interaction; typically implies exceptional or devastating, psychological damage."},{"kink_id":49,"name":"Fear","description":"Refers to the incorporation of one or more character(s) having reason to be fearful during the sexual (or even nonsexual) aspects of an RP."},{"kink_id":674,"name":"Femdom","description":"Play in which a character of female gender takes the role of dominant, maintaining control and authority; being considered the focal point of the dynamic. It is defined as an exchange founded on her needs, pleasures, and desires, with the submissive&rsquo;s purpose to provide service to her first and foremost."},{"kink_id":53,"name":"Forced Incest","description":"Engaging in an RP in which a character is forced to have sex with a character who is related to them, either by blood or marriage."},{"kink_id":52,"name":"Forced Nudity","description":"The act of either forcing a character to be nude or being forced to be nude by another character; typically used in public situations."},{"kink_id":337,"name":"Force Feeding","description":"Engaging in an RP in which a character, typically bound or otherwise immobile, is forced to consume large, often impossible and unrealistic, amounts of food against their will, often resulting in inflation and \/ or weight gain."},{"kink_id":130,"name":"Humiliation","description":"Engaging in an RP in which one character will be embarrassed, typically extremely and \/ or frequently, in an attempt to elicit either a response of sexual gratification from the emotions correlating to humiliation, or merely as a form of psychological domination or punishment; typically a more intense form of degradation."},{"kink_id":129,"name":"Hypnotism \/ Mind Control","description":"Engaging in an RP in which one character will mentally and \/ or supernaturally take control of another character&#039;s mind and \/ or body through psychic means or hypnotic means, sometimes through the use of supernatural or magical powers."},{"kink_id":679,"name":"Impotence","description":"Expresses an interest in characters that are unable to achieve an erection (or arousal) without, or even with, help."},{"kink_id":680,"name":"Lima Syndrome","description":"The act of a character that is an abductor developing sympathy for their captives, trusting and \/ or displaying affection for their captive \/ victim."},{"kink_id":251,"name":"Master \/ Pet","description":"Engaging in an RP in which a domination \/ submission relationship is played between at least two characters, and in which the bottom character takes on the role of a pet; typically a training-based scenario with positive reinforcement over negative reinforcement, as well as the inclusion of affection."},{"kink_id":32,"name":"Master \/ Slave","description":"Engaging in an RP in which a domination \/ submission relationship is played between at least two characters, and in which the bottom character takes on the role of a slave; typically requires the slave to accept any and all commands, often involves non-sexual forms of abuse and uses negative reinforcement."},{"kink_id":675,"name":"Mental Torture","description":"An expressed interest in scenes that involve torture that is psychological in nature, typically involving themes of fear, paranoia, insanity, mental abuse, and so on."},{"kink_id":263,"name":"Objectification","description":"The act of either being treated or treating another character as a specific and set object, often articles of furniture, or bestowing dehumanizing tasks to a character in order to imbue a character with the traits of an object."},{"kink_id":433,"name":"Orientation Play","description":"Expresses an interest in RP&#039;s in which one character&#039;s sexual orientation will be a focal point of the scene, typically in correlation with the discovery, exploration, or coercion of bisexuality \/ homosexuality in the sexuality of a character."},{"kink_id":152,"name":"Physical Restraints","description":"The act of giving or receiving commands, typically verbal, that limit the way in which another character is permitted to physically interact with another character."},{"kink_id":676,"name":"Possessiveness \/ Jealousy","description":"Describes a character who is or becomes jealous or even possessive of their partner(s). Such a character may be (overly) demanding and overbearing in a relationship, growing aggressive towards those that may encroach on said partner."},{"kink_id":677,"name":"Powerbottoming","description":"An expressed interest in a sexual exchange where the character who is receiving penetration is in control, dominant, taking initiative, or directing the interaction."},{"kink_id":349,"name":"Public Humiliation","description":"One or more characters engaging in explicit and elicit, sexual activity in a public setting for the purposes of humiliating one or more characters."},{"kink_id":313,"name":"Puppy \/ Pony Play","description":"Engaging in an RP in which a domination \/ submission relationship is played between two characters, and in which the bottom character takes on the role and psyche of a feral puppy, pony, or other predetermined animal; typically involves rituals, speech restrictions, physical restrictions, and humiliation, as well as extensive training and a mixture of positive and negative reinforcement."},{"kink_id":175,"name":"Sexual Restraints","description":"Refers to a dominant giving a command for how the submissive may act in regard to sexual acts or within a sexual situation; often a decree of chastity or prohibition from any form of sexual contact."},{"kink_id":343,"name":"Sissification","description":"The act of changing the appearance of a male character through realistic means, particularly by the use of makeup, female clothes and \/ or female accessories, to appear as a female and \/ or forcing the male to adopt the mannerisms of a female, or being the recipient of such actions."},{"kink_id":265,"name":"Speech Restrictions","description":"The act of giving or receiving commands, typically verbal, that limit the way in which another character is permitted to speak or otherwise make noise from one&#039;s mouth; typically used in a BDSM context to constrain the submissive to begging, animal noises or silence."},{"kink_id":678,"name":"Stockholm Syndrome","description":"The act of a character trusting or displaying affection towards those responsible for kidnapping \/ taking them as a hostage, may or may not involve actual kidnapping vs. a domestic abuse relationship."},{"kink_id":431,"name":"Uppity","description":"Expresses an interest in engaging in an RP in which the submissive and \/ or bottom character is combative and disobedient in any number of ways."},{"kink_id":82,"name":"Verbal Abuse","description":"The act of verbally accosting or being verbally accosted with derogatory terms pertaining to sex, or in the effort to demean, degrade or otherwise humiliate another character, or occasionally to elicit sexual stimulation from abuse."}]},"41":{"group":"Dress Up &amp; Materials","items":[{"kink_id":491,"name":"Clothed Sex","description":"Engaging in an RP where you and \/ or your partner are not undressed during sexual interaction."},{"kink_id":672,"name":"Clothing Play","description":"Expresses an interest in scenes where clothing plays a distinct involvement, such as lingerie, using certain articles of clothing sexually, or having a character wearing (or being made to wear) various outfits."},{"kink_id":6,"name":"Crossdressing","description":"Engaging in an RP where one or more characters dress in the clothes considered traditionally atypical for their identifying gender."},{"kink_id":29,"name":"Diapers","description":"A situation in which at least one character will wear a diaper. May imply &quot;soiling usage&quot; of the diaper, but not necessarily. Often related with ageplay or infantilism, but sometimes in conjunction with humiliation."},{"kink_id":417,"name":"Footgear Worship","description":"The act of giving gratuitous acknowledgment to the shoes or boots of one&#039;s partner, typically referring to oral play, often to clean or shine the exterior of the shoes or boots, or musk play, when regarding the interior of the shoes or boots."},{"kink_id":144,"name":"Forced Clotheswearing","description":"The act of either forcing a character to wear or being forced to wear specific garments of clothing of the other character&#039;s choosing; often humiliating."},{"kink_id":418,"name":"Glasses","description":"A preference for characters who wear glasses."},{"kink_id":90,"name":"Latex \/ Rubber","description":"The usage of latex and \/ or rubber material worn as clothing and \/ or used as a form of mummification \/ bondage; typically full body suits."},{"kink_id":247,"name":"Leather","description":"The use of leather, often in a bondage situation; typically includes leather garments or equipment associated with dominants, as well as harness gear."},{"kink_id":421,"name":"Masks","description":"The use of masks (surgical, BDSM, gas masks, etc), typically to conceal the wearer&#039;s identity, in an RP scene."},{"kink_id":172,"name":"Sexy \/ Slutty Clothing","description":"Having least one character wear clothing that is of a sexually suggestive or explicit nature, including but not limited to exceptionally short skirts, flamboyant underwear, excessively tight clothing, clothing with explicit graphics, etc."},{"kink_id":432,"name":"Socks \/ Stockings","description":"Expresses an interest in the inclusion of socks and \/ or stockings in the sexual context of an RP, or an interest in characters wearing such."},{"kink_id":307,"name":"Strip Tease","description":"The act of dramatically removing clothing or watching a participant do such, typically as a form of seduction."},{"kink_id":216,"name":"Underwear","description":"An affinity for underwear, either being worn on one&#039;s self, one&#039;s partner(s) or by itself; often involves stimulation from the scent or tactility of the underwear, but may also refer to using underwear as a sex toy in any way."},{"kink_id":217,"name":"Underwear Bulges","description":"The act of being sexually aroused or stimulated by the sight and \/ or feel of someone&#039;s genitalia creating a bulge on the front of their underwear; typically refers to exceptionally large bulges, and may include pants bulges as well."},{"kink_id":219,"name":"Uniforms","description":"The act of being sexually aroused by uniforms or work-related attire, and \/ or engaging in RPs in which characters will wear such clothing."},{"kink_id":673,"name":"Wardrobe Malfunctions","description":"An interest in scenes that involve clothing mishaps. May involve parts of a character&#039;s body being exposed unintentionally, clothing breaking, failing, or being ill fitting."}]},"29":{"group":"Gender Preferences","items":[{"kink_id":231,"name":"Cuntboys","description":"Expresses an interest in male characters who have a vagina instead of typically male genitals."},{"kink_id":554,"name":"Females","description":"Expresses an interest in traditionally female characters."},{"kink_id":132,"name":"Hermaphrodites","description":"Expresses an interest in female-identifying characters that have breasts, a penis, and a vagina."},{"kink_id":552,"name":"Male-Herms","description":"Expresses an interest in male-identifying characters that have a penis and a vagina."},{"kink_id":553,"name":"Males","description":"Expresses an interest in traditionally male characters."},{"kink_id":712,"name":"Nonbinary","description":"Characters that do not strictly identify or abide by a gender binary (regardless of originally assigned gender or biological sex). "},{"kink_id":356,"name":"Shemales","description":"Expresses an interest in female-identifying characters that have a penis (and typically breasts), but not a vagina."},{"kink_id":606,"name":"Trans Females","description":"Expresses an interest in transgender characters that identify as female regardless of originally assigned gender or biological sex."},{"kink_id":551,"name":"Transgender","description":"Expresses an interest in characters whose assigned sex and identified gender are not the same, who identifies as a non-binary gender, or who has transitioned (or is in the process of transitioning) from one previously assigned gender to another."},{"kink_id":607,"name":"Trans Males","description":"Expresses an interest in transgender characters that identify as male regardless of originally assigned gender or biological sex."}]},"27":{"group":"General Kinks","items":[{"kink_id":580,"name":"Ahegao","description":"Commonly referred to as &ldquo;fucked silly.&rdquo; Refers to a character wearing a facial expression that signifies an immense amount of pleasure during sexual intercourse \/ or sexual arousal."},{"kink_id":581,"name":"Aphrodisiacs","description":"The incorporation of a food, drink, drug, scent, or other such stimulate that generates sexual arousal."},{"kink_id":250,"name":"Condoms","description":"The use of condoms in any way; typically refers to a preference for the use of condoms during penetration, but may also refer to condom play, in which a condom (typically filled), is used as a sex toy; or, the filling of condoms with fluids, such as semen."},{"kink_id":300,"name":"Crotch Sniffing","description":"The act of receiving pleasure from inhaling the scent of the crotch, or receiving such actions. Emphasis is often placed on the musk and \/ or pheromone-related properties of the scent."},{"kink_id":259,"name":"Drug \/ Alcohol Use","description":"The use of illicit drugs and \/ or alcohol in the context of an RP."},{"kink_id":148,"name":"Flexibility \/ Contortionism","description":"Exceptional or unrealistic flexibility, typically used to achieve extremely difficult or impossible sexual positions to derive maximum stimulation."},{"kink_id":284,"name":"Food Play","description":"The act of incorporating food into the sexual context of an RP, or which may include (but is not limited to) use of whipped cream or chocolate sauce in a sexual act, receiving sexual gratification from the act of eating, or including rather large amounts of food (but not necessarily). "},{"kink_id":579,"name":"Foreplay","description":"Sexual activity that precedes intercourse, incorporating various forms of erotic build up before the actual act of sex."},{"kink_id":125,"name":"Ice","description":"The use of ice in any fashion during sex, typically as a form of erotic foreplay."},{"kink_id":711,"name":"Inflatables","description":"An expressed interest in characters (or objects) that are inflatable in nature, such as balloons, pool toys, or characters \/ objects compiled of elastic material meant to be expanded."},{"kink_id":582,"name":"Interracial","description":"Romantic \/ sexual interaction between or involving different races."},{"kink_id":353,"name":"Multiple Orgasms","description":"The act of cumming multiple times, sometimes in direct succession, or being the recipient of such actions."},{"kink_id":306,"name":"Natural Musk","description":"Refers to an RP involving characters where the aspect of musk is notably present \/ involved in play. Generally implies one or more characters having a distinct scent (typically with pheromones derived from the crotch)."},{"kink_id":710,"name":"Objectophilia","description":"A deep interest in particular inanimate objects. Denotes an expressed preference and \/ or strong feelings of love, sexual attraction, and \/ or commitment to certain items or structures of a character&#039;s fixation. Said objects may be things such furniture, cars, buildings, toys, clothing, and so on."},{"kink_id":527,"name":"Onomatopoeia","description":"Engaging in an RP, or getting turned on by an emphasis on exaggerated descriptions of sexual noises in a roleplay, usually described with onomatopoeia, words that seek to duplicate the sounds they describe. Often refers to fluid noises such as: slosh, splurt, squirt, gurgle, splortch, or others."},{"kink_id":171,"name":"Potions \/ Injections","description":"The act of using and \/ or receiving a substance through any means that has a physical or mental effect on the character receiving it; implies fantastical or unrealistic results."},{"kink_id":168,"name":"Sex Toys","description":"Refers to the inclusion of (generally penetrating) sex toys in an RP, including but not limited to dildos, vibrators, anal eggs, anal beads, flesh tubes, etc."},{"kink_id":169,"name":"Sexual Exhaustion","description":"Engaging in an RP in which at least one character&#039;s genitals and \/ or orifice(s) endure pain due to exceptionally arduous sex or sex of an exceptional duration; implies continuing despite such."},{"kink_id":331,"name":"Sexual Frustration","description":"Engaging in an RP in which at least one character is exceptionally desperate or horny and is often willing to eschew standard inhibitions in order to receive sexual stimulation."},{"kink_id":260,"name":"Shaving","description":"Engaging in the removal of fur \/ hair from a participant in an RP by the means of shaving."},{"kink_id":181,"name":"Smoking","description":"Refers to the act of smoking and \/ or receiving pleasure from an aspect of smoking or smoke during an RP."},{"kink_id":191,"name":"Stomach Bulging","description":"Engaging in an RP in which a character&#039;s stomach will bulge, either due to an exceptionally large insertion (often taking the shape of such), due to eating an exceptionally large amount of food, or as a localized form of inflation from any liquid or gas."},{"kink_id":71,"name":"Strap-ons","description":"Engaging in an RP in which at least one character will wear a strap-on to penetrate another character."},{"kink_id":583,"name":"Stuckage","description":"The act of a character getting trapped \/ stuck in one manner or another. For example: holes, doorways, windows, chairs."},{"kink_id":305,"name":"Sweat","description":"The act of sweating and \/ or receiving sexual gratification from the appearance, taste, scent and \/ or tactility of sweat."},{"kink_id":496,"name":"Tail Pulling","description":"Pulling a partner&#039;s tail during sexual intercourse. Often as a means of forcing the bottom to clench, or as a handle, or merely a cute act."},{"kink_id":69,"name":"Teasing","description":"Refers to extended scenes of foreplay prior to explicit, sexual intercourse, which may be physical and \/ or verbal, typically to arouse one&#039;s partner to the point of sexual frustration or desperation."},{"kink_id":79,"name":"Tickling","description":"The act of tickling and \/ or being tickled in a sexual context of an RP; or, receiving sexual stimulation from such."}]},"45":{"group":"Gore \/ Torture \/ Death","items":[{"kink_id":1,"name":"Abrasions","description":"Engaging in a situation in which at least one character will receive abrasions, defined as scrapes that are at their mildest in severity capable of causing bleeding; typically administered via rough or coarse objects, such as sandpaper or cement."},{"kink_id":4,"name":"Bloodplay","description":"Pertains to the inclusion of blood or the retrieval of blood in any form in a sexual context, or engaging in acts which will draw blood."},{"kink_id":492,"name":"Branding","description":"A situation in which at least one character will be branded, usually as a form of sadomasochism. Typically by means of applying intense heat in a specific pattern designed to visually show ownership."},{"kink_id":36,"name":"Breast \/ Nipple Torture","description":"A situation in which at least one character&#039;s breasts or nipples will be the subject of physical, non-sexual pain of an extended duration."},{"kink_id":21,"name":"Burning","description":"A situation in which at least one character will be burned. May include burning with such things as cigars, cigarettes, hot iron, or other methods."},{"kink_id":20,"name":"Castration","description":"An action where the testicles (or ovaries) are removed or disabled, whether by surgical, chemical or magical means."},{"kink_id":28,"name":"Death","description":"A situation in which a character will die at any point by any means."},{"kink_id":508,"name":"Emasculation","description":"The act whereby the genitalia are removed by magical or surgical means, usually the penis and \/ or the testicles. May also imply humiliation; e.g. to render a male less of a man."},{"kink_id":717,"name":"Execution \/ Murder","description":"The act of actively causing death to a character that is not accidental. Implies committing lethal acts on a character that is intended to result in their end, or being the receiver of such actions."},{"kink_id":276,"name":"Genital Torture","description":"Engaging in an RP in which at least one character&#039;s genitals will be given negative attention, the intent of which to be to cause physical pain."},{"kink_id":689,"name":"Gore","description":"The involvement of graphic violence and carnage, generally of serious physical injuries involving blood, flesh, bone, and internal organs."},{"kink_id":270,"name":"Impalement","description":"Describes a character being pierced by an object, and subsequently having it extend out and through an exit wound. Typically implies pain, torture, and is often fatal."},{"kink_id":99,"name":"Menses","description":"Engaging in an RP in which menstruation will be involved, or applied to the sexual context of a scene."},{"kink_id":96,"name":"Mutilation","description":"The act of physically damaging or otherwise causing irreparable change and \/ or harm to a character in an RP, typically by the use of cutting, stabbing or contact objects; often exceptionally painful."},{"kink_id":308,"name":"Necrophilia","description":"The act of having sex with a dead, or otherwise unconscious or inanimate, character that was once alive, or, theoretically, receiving such actions."},{"kink_id":486,"name":"Nonsexual Pain","description":"Refers to either the administering and \/ or receiving of pain that is not derived through sexual activity and does not cause sexual gratification for the recipient, often interpreted to mean pain that is located in non-sexual parts of one&#039;s body."},{"kink_id":103,"name":"Nonsexual Torture","description":"The act of causing or receiving extended scenes of pain due to acts that are not of a sexual nature, or giving or being the recipient of psychological abuse for extended periods of time or at a great degree of intensity."},{"kink_id":334,"name":"Nullification","description":"The removal \/ amputation of any body part."},{"kink_id":479,"name":"Piercing","description":"The act of piercing a character&#039;s body, typically in a painful manner, and often in a sexual or exceptionally sensitive location on the person&#039;s body, or having one&#039;s own body pierced."},{"kink_id":174,"name":"Sexual Torture","description":"Torture that is sexual in nature, or greatly harms one sexually."},{"kink_id":202,"name":"Swallowing Blood","description":"The act of orally consuming blood."},{"kink_id":690,"name":"Tooth Removal","description":"Expresses an interest in play that involves tooth removal."},{"kink_id":691,"name":"Wound Fucking","description":"Inserting one&rsquo;s cock into a wound, either preexisting or freshly made, in order to engage in intercourse."}]},"46":{"group":"Inflation, Growth, &amp; Sizeplay","items":[{"kink_id":695,"name":"Ass Growth","description":"A situation where at least one character&#039;s ass grows in size, typically to fantastical proportions, by any means, including but not limited to magical or chemical."},{"kink_id":693,"name":"Blueberrification","description":"The process of a character being inflated into a spherical shape by swelling with juice, accompanied by their skin turning into shades of blue (or other fruit hues)."},{"kink_id":359,"name":"Breast Growth","description":"A situation in which at least one character&#039;s breasts grow in size, typically to fantastical proportions, by any means, including but not limited to magical or chemical."},{"kink_id":255,"name":"Cock \/ Ball Growth","description":"A situation in which at least one character&#039;s penis and testicles grow in size, typically to fantastical proportions, by any means, including but not limited to magical or chemical infusion or due to sexual fluids becoming blocked or otherwise obstructed."},{"kink_id":58,"name":"Cum Inflation (Heavy \/ Extreme)","description":"Engaging in an RP in which at least one character is filled with an impossible amount of semen, typically directly from the penis due to anal, vaginal or oral sex, causing their stomach and \/ or body to expand to fantastical sizes."},{"kink_id":54,"name":"Cum Inflation (Light \/ Medium)","description":"Engaging in an RP in which at least one character is filled with a massive amount of semen, typically directly from the penis due to anal, vaginal or oral sex, causing their stomach and \/ or body to bulge or become somewhat round."},{"kink_id":427,"name":"Forced Growth","description":"Expresses an interest in which at least one character will be forced to endure themselves, or any part(s) of their body, growing against their will."},{"kink_id":383,"name":"Growth","description":"Growing in body size by magical, medicinal, or otherwise fantastic means."},{"kink_id":384,"name":"Growth (Macro)","description":"Growing in body size to heights in vast excess, often to seemingly impossible sizes."},{"kink_id":389,"name":"Hyper Muscle Growth","description":"Increasing the size or strength of one&#039;s muscles to excessive or impossible degrees."},{"kink_id":694,"name":"Immobilization (Size)","description":"Engaging in an RP in which at least one character will be rendered immobile due to a variety of reasons, typically due to some form of bodily growth. May be a result of extremer forms weight gain, inflation, or a part of their body growing to impeccable sizes such as their breasts, cock, ass, or muscles that result in them becoming encumbered."},{"kink_id":357,"name":"Inflation (Heavy \/ Extreme)","description":"Engaging in an RP in which at least one character is filled with an impossible amount of a substance other than a bodily fluid, typically a gas or liquid, causing their stomach and \/ or body to expand to fantastical sizes."},{"kink_id":350,"name":"Inflation (Light \/ Medium)","description":"Engaging in an RP in which at least one character is filled with a massive amount of a substance other than a bodily fluid, typically a gas or liquid, causing their stomach and \/ or body to bulge or become somewhat round."},{"kink_id":388,"name":"Muscle Growth","description":"Increasing the size or strength of one&#039;s muscles by magical, medicinal, or other fantastic means."},{"kink_id":271,"name":"Popping","description":"The act of causing a part of a character&#039;s anatomy, or the entire character, to explode by means of ballooning or inflation, or being the recipient of such actions."},{"kink_id":501,"name":"Shrinking","description":"Reducing in body size, usually a reduction of about one foot in size, or being the receiver of such actions."},{"kink_id":387,"name":"Shrinking (Micro)","description":"Reducing in body size to such an extent that inches or smaller units are the most that can be used for measurement."},{"kink_id":692,"name":"Weight Gain (Heavy \/ Extreme)","description":"The act of a character gaining significant amounts of weight (be it through the increased consumption of food, magical \/ scifi effects, or other influences) or engaging in an RP where a character does as such. Typically in unrealistic or large quantities and paces."},{"kink_id":493,"name":"Weight Gain (Light \/ Medium)","description":"The act of a character gaining weight (be it through the increased consumption of food, magical \/ scifi effects, or other influences) or engaging in an RP where a character does as such. Typically in more realistic amounts and paces."},{"kink_id":494,"name":"Weight Loss","description":"The act of losing of weight through various means, or engaging in an RP in which a character does such.May be done realistically, unrealistically, through starvation, work out, through magical \/ scifi effects, or a variety of other methods."}]},"34":{"group":"Oral Sex &amp; Play","items":[{"kink_id":629,"name":"Ass to Mouth","description":"The act of anally penetrating a character with a cock (or phallic object, in terms of strap ons), then withdrawing the cock and having it go straight to the other&rsquo;s mouth for them to perform oral."},{"kink_id":372,"name":"Auto-Fellatio","description":"The act of performing fellatio or cunnilingus on one&#039;s self."},{"kink_id":513,"name":"Cunnilingus (Giving)","description":"The act of performing cunnilingus -- oral sex on a character&#039;s vagina."},{"kink_id":515,"name":"Cunnilingus (Receiving)","description":"The act of receiving cunnilingus -- oral sex on a character&#039;s vagina."},{"kink_id":346,"name":"Face-Fucking","description":"Refers to the act of penetrating the mouth of another character with a similar technique as fucking a vagina or anus, typically by bracing the mouth or skull and thrusting back and forth; often rough."},{"kink_id":206,"name":"Face-Sitting","description":"A sexual practice where someone sits on another character&#039;s face with their buttocks or genitals, causing the person to be smothered, sometimes to the point of asphyxiation; often done as a form of forcing oral gratification."},{"kink_id":512,"name":"Fellatio (Performing)","description":"The act of performing fellatio -- oral sex on a character&#039;s penis."},{"kink_id":514,"name":"Fellatio (Receiving)","description":"The act of receiving fellatio -- oral sex on a character&#039;s penis."},{"kink_id":626,"name":"Fingers in Mouth","description":"Expresses an interest in play that involves inserting fingers in one&rsquo;s mouth. Often implies sucking, licking, feeling out one&rsquo;s mouth in an exploratory fashion, or possibly inserting something into it."},{"kink_id":462,"name":"Kissing","description":"Expresses an interest in kissing or being kissed by another character, typically denoting French kissing."},{"kink_id":115,"name":"Licking","description":"The act of one character licking another. May or may not be sexual."},{"kink_id":627,"name":"Oral Fixation","description":"An act in which a character is unconsciously obsessed with the mouth and feels the need to be sucking, chewing, or inserting something into it."},{"kink_id":141,"name":"Oral Sex (Giving)","description":"The act of performing fellatio or cunnilingus."},{"kink_id":158,"name":"Oral Sex (Receiving)","description":"The act of receiving fellatio or cunnilingus."},{"kink_id":106,"name":"Oral Virginity","description":"Engaging in an RP in which a character that has never performed fellatio or cunnilingus performs such acts."},{"kink_id":562,"name":"Saliva","description":"Interest in roleplay that prominently includes saliva. This may refer to excessive secretion and great appreciation of it."},{"kink_id":628,"name":"Teeth Play","description":"Expresses an interest in play that revolves around one&rsquo;s teeth. Often denotes cleaning and similar dental play."},{"kink_id":74,"name":"Throat Penetration","description":"The act of penetrating the mouth of another character to the depths at which the penis or insertion enters the back of the mouth cavity and \/ or throat, sometimes causing a gag reflex, or being the recipient of such actions."}]},"37":{"group":"Penetration &amp; Sexual Themes","items":[{"kink_id":77,"name":"3+ Penetration","description":"The act of penetrating a single character with three or more objects, including but not limited to cocks, sex toys, hands, etc., or receiving such actions."},{"kink_id":713,"name":"All the Way Through","description":"The act of a character being penetrated by an object (generally in a nonharmful fashion), and having it extend out their other end - typically ass \/ vagina to mouth, vice versa, or other orifices in a less realistic fashion. May also include fluids being pumped into one end and coming out the other. "},{"kink_id":11,"name":"Double Penetration","description":"The act of penetrating a single character with two objects, including but not limited to the penis, sex toys, fist etc., or receiving such."},{"kink_id":274,"name":"Extreme Tightness","description":"Engaging in an RP in which at least one character exhibits exceptional tightness in their anus, vagina, or throat; sometimes implies pain, exceptionally large penetrations and \/ or inexperience."},{"kink_id":636,"name":"Gangbangs","description":"A situation in which several people engage in physical sexual activity with one particular character sequentially or at the same time."},{"kink_id":490,"name":"Knotting \/ Tying","description":"The act of lodging the knot of a penis, typical of canine anatomy, into an orifice to &quot;tie&quot; with your partner."},{"kink_id":262,"name":"Living Insertions","description":"The act of inserting an animate object(s) into an orifice, or receiving such action; typically worms, insects, or alien creatures."},{"kink_id":559,"name":"Nipple Penetration","description":"The act of penetrating the nipple, often deep into the breast, with an object such as a finger, sex toy or penis, etc., or receiving such actions."},{"kink_id":635,"name":"Non-Standard Penetration","description":"Alternative forms of penetration outside of the norm such as of the ears, nose, eyes, or generating new \/ nonstandard holes to use in a sexually penetrative fashion."},{"kink_id":637,"name":"Somnophilia","description":"The act of engaging in sexual intercourse with a sleeping partner or enjoying being on the receiving end thereof."},{"kink_id":253,"name":"Sounding","description":"The act of inserting metal rods into a character&#039;s urethra, or receiving such actions; technically implies rods that resonate and \/ or vibrate in response to a form of stimulation, but does not necessarily mean so."},{"kink_id":315,"name":"Tailsex","description":"Penetrating an orifice using a character&#039;s tail."},{"kink_id":638,"name":"Tantric Sex","description":"A form of sex characterized by its focus on intimacy and emotional closeness between involved parties. Often implies a long duration with a significant aim on their intertwining such as listening to heartbeats, breathing, and exploring one another through a deep romantic bond."},{"kink_id":254,"name":"Urethra Play","description":"Sexual stimulation or play involving the urethra. When involving cocks, typically connotates inserting objects into the penis."},{"kink_id":561,"name":"Vanilla Sex","description":"Sex which does not involve such elements as BDSM, kink, or fetish activities."}]},"48":{"group":"Pregnancy &amp; Breeding","items":[{"kink_id":702,"name":"Alternative Pregnancy","description":"Pregnancy that takes place in areas of the body other than the womb through vaginal means, such as the breasts, balls, limbs, tail, and so on."},{"kink_id":704,"name":"Anal Pregnancy","description":"Pregnancy that takes place rectally in the anal canal."},{"kink_id":461,"name":"Birthing","description":"Scenes in which someone goes into labor or gives birth; participants may derive sexual gratification from the experience."},{"kink_id":520,"name":"Breeding","description":"Entails the act sexual intercourse for the sole purpose of inducing pregnancy and \/ or producing offspring."},{"kink_id":272,"name":"Extreme Pregnancy","description":"The act of becoming pregnant with an incredible or unrealistic size and \/ or number of fetuses \/ eggs, often in an unrealistically short time span, and often to the point of immobility, or engaging in an RP in which at least one character fits such a description."},{"kink_id":507,"name":"Heat \/ Rut","description":"A character entering a state of heightened sexual arousal which often alters or overrides their inhibitions. May correspond with being more receptive to impregnation \/ the ability to impregnate."},{"kink_id":703,"name":"Impregnation","description":"Expresses an interest in actions where impregnating a character is the focused act, actively trying to get another character pregnant in one form or another."},{"kink_id":198,"name":"Male Pregnancy","description":"The act of a male identifying character becoming pregnant during the course of an RP, or engaging in an RP in which at least one male character is pregnant."},{"kink_id":150,"name":"Oviposition","description":"Engaging in an RP in which at least one character will lay eggs through an orifice."},{"kink_id":154,"name":"Pregnancy","description":"Engaging in an RP in which at least one character is pregnant, and \/ or includes themes of pregnancy."},{"kink_id":160,"name":"Risk of Pregnancy","description":"Engaging in an RP in which there is an immediate and serious risk of at least one character becoming pregnant; often implies that at least one character does not want such a result."}]},"38":{"group":"Roleplay Preferences","items":[{"kink_id":639,"name":"Approaching IC","description":"Approaching another roleplayer while &ldquo;in character.&rdquo; Generally means carrying out actions, speaking as your character, and other forms of character emoting. This is a means of diving straight into roleplay with little to no out-of-character discussion beforehand."},{"kink_id":640,"name":"Approaching OOC","description":"Approaching another roleplayer while &ldquo;out of character.&rdquo; Generally means speaking to another player as yourself the player, not as your character, and does not involve actions or emotes from your character. This is done to discuss scenes and RP ideas first with the player, rather than jumping into something without forethought."},{"kink_id":641,"name":"Drawn Image References","description":"Expresses an interest in character profiles that use drawn \/ art images for visual references for their character."},{"kink_id":535,"name":"Instant Hookups","description":"An in-character meeting between one or more characters that more often than not will lead to sudden intercourse without much thought prior to it."},{"kink_id":538,"name":"Multiple Characters","description":"Expresses an interest in the ability to take turns playing a character other than one&#039;s main character in a single roleplay, or simply involving a number of other characters within a roleplay."},{"kink_id":273,"name":"Nonsexual Roleplay","description":"Scenes of extended play that involve either no sex or very little sex."},{"kink_id":642,"name":"Photograph References","description":"Expresses an interest in character profiles that use (professional standard, in accordance with site rules) photos, or &ldquo;face claims&rdquo; for visual references for their character."},{"kink_id":539,"name":"Plot Twists","description":"Revelatory events in storytelling that alter the course of the roleplay."},{"kink_id":643,"name":"Private Roleplay","description":"Expresses an interest in conducting roleplay in private, be it private messages, notes, or some other nonpublic means of messaging."},{"kink_id":644,"name":"Public Room Roleplay","description":"Expresses an interest in conducting roleplays publicly, usually in a group with other players, in an open room within F-Chat (or group threads)."},{"kink_id":542,"name":"Roleplay Perspective - First Person","description":"Roleplaying in a first-person perspective. &quot;I see you.&quot; is an example of a sentence written in first person."},{"kink_id":544,"name":"Roleplay Perspective - Second Person","description":"Using the word &lsquo;you&rsquo; to refer to another&rsquo;s character and third person to refer to one&rsquo;s own."},{"kink_id":543,"name":"Roleplay Perspective - Third Person","description":"Roleplaying from a third-person perspective. &quot;He sees her.&quot; is an example of a sentence written in third person."},{"kink_id":429,"name":"Sex Driven","description":"Expresses a preference to eschew story and \/ or character development to reach the sexual context of a scene more quickly."},{"kink_id":428,"name":"Story Driven","description":"Expresses a preference for RPs where plot and story are the focal point, typically involving complex situations, character development, framed scenes, elaboration, and amplification of settings. Often (but not necessarily) comparatively containing little sex."},{"kink_id":577,"name":"Storytelling (Narrator)","description":"Expresses an interest in narrating the story, playing as the entire setting and running most of the characters and the environment for their partner(s), usually without playing a protagonist character of their own."},{"kink_id":578,"name":"Storytelling (Player)","description":"Expresses an interest in playing the protagonist character in a story narrated by their partner, where the partner plays as the entire setting and running most of the characters and the environment for the protagonist character."}]},"44":{"group":"Roughness \/ Pain","items":[{"kink_id":684,"name":"Abuse","description":"The act of applying abusive actions onto a character, typically through acts of physical violence. Involves subjecting a character(s) to unpleasant situations and behaviors."},{"kink_id":555,"name":"Ballbusting","description":"Harm to the testicles, usually for sexual pleasure."},{"kink_id":5,"name":"Biting","description":"The act of biting or being bitten; sometimes painful, sometimes playful."},{"kink_id":15,"name":"Breath Control","description":"A situation in which at least one character will have physical control over the breathing habits of another character, often by either intermittent choking and \/ or due to the penetration of the throat."},{"kink_id":22,"name":"Choking","description":"A situation in which one character will control another character&#039;s breath with extreme force, and typically for extended and \/ or dangerous periods of time."},{"kink_id":687,"name":"Crushing (Living)","description":"The act of crushing living organisms (such as people, animals, and other sentient life) with one&rsquo;s body, or being aroused by another individual doing so."},{"kink_id":688,"name":"Crushing (Objects)","description":"The act of crushing inanimate objects (such as food, furniture, toys, housing structure) with one&rsquo;s body, or being aroused by another individual doing so."},{"kink_id":519,"name":"Face Slapping","description":"Slaps to the face, of any degree or severity."},{"kink_id":139,"name":"Hair Pulling","description":"The act of pulling or tugging on another character&#039;s hair, or being the recipient of such."},{"kink_id":685,"name":"Roughness","description":"The involvement of rough behavior and actions (typically during sex) upon a partner. Usually denotes harsh grabbing, pulling, brisk brusque motions, and similar physical conduct."},{"kink_id":370,"name":"Sadism \/ Masochism","description":"The act of taking the role of a sadist or masochist, meaning one that receives sexual gratification from being the recipient of or administering physical pain."},{"kink_id":167,"name":"Scratching","description":"One character scratching another with their nails or claws, sometimes leaving marks; but not necessarily painful."},{"kink_id":170,"name":"Sexual Pain","description":"Refers to the inclusion of physical pain due to acts which are directly sexual; typically rough or excessive penetrations."},{"kink_id":199,"name":"Spanking","description":"The act of striking the buttocks of another character, or being the recipient of such; often as a form of erotic foreplay or as punishment in a BDSM setting."},{"kink_id":686,"name":"Violence","description":"Themes that incorporate the use of intense force that results in physical pain and discomfort."},{"kink_id":258,"name":"Wax Play","description":"The act of using wax, typically hot candle wax, as a form of sexual stimulation and \/ or torture, or receiving such actions."}]},"30":{"group":"Species Preferences","items":[{"kink_id":223,"name":"Amphibians","description":"Salamanders, Frogs, Toads, Newts, etc."},{"kink_id":523,"name":"Angels","description":"Angels or other celestials, typically magical. "},{"kink_id":487,"name":"Animals \/ Ferals","description":"Refers to the preference and \/ or interest in partners whose characters are non-sentient, and typically quadrupedal and \/ or non-anthropomorphized, animals, which may or may not necessarily be anatomically accurate in regard to body size."},{"kink_id":215,"name":"Avians","description":"Birds, gryphons, phoenixes, rocs, chimeras etc."},{"kink_id":451,"name":"Bats","description":"Bats and other true-flight mammals."},{"kink_id":318,"name":"Bovines","description":"Bulls, cows, buffalo etc."},{"kink_id":226,"name":"Canines","description":"Domesticated dogs, wolves, dingos, coyotes, jackals etc."},{"kink_id":558,"name":"Caprinae","description":"Sheep, goats, etc."},{"kink_id":227,"name":"Cervines","description":"Deer, elk, moose etc."},{"kink_id":7,"name":"Demons","description":"Demons or devils, typically magical. May also include other, fantastical creatures, such as but not limited to Incubi, Succubi, and fiends."},{"kink_id":503,"name":"Digimon","description":"Characters from the manga and television show &quot;Digimon&quot;,"},{"kink_id":610,"name":"Dinosaurs","description":"Prehistoric species such as tyrannosaurus rex, triceratops, raptors, apatosaurus, etc."},{"kink_id":530,"name":"Divinities","description":"Gods, goddesses, demi-gods and demi-goddesses of all sorts, ranging from those barely more powerful than a mortal to the nearly omnipotent."},{"kink_id":228,"name":"Dragons","description":"Dragons, drakes, wyverns, etc."},{"kink_id":618,"name":"Driders","description":"Describes a kind of species that is a combination of human and spider. Usually, their anatomy consists of a (mostly) humanoid upper body seated on top of the body of a spider. It may refer to hybrids with mostly humanoid or arachnid features as well."},{"kink_id":611,"name":"Elves","description":"Humanoid individuals characterized by long pointed ears and typically containing fantasy elements."},{"kink_id":236,"name":"Equines","description":"Horses, donkeys, mules, zebra, centauri etc."},{"kink_id":481,"name":"Exotic Species","description":"Expresses an interest for uncommon, hybrid or otherwise exotic choices in species."},{"kink_id":612,"name":"Fae","description":"Beings of the mythical and supernatural variety, generally consisting of things such as fairies, imps, spirits, elementals, etc."},{"kink_id":212,"name":"Felines","description":"Domesticated cats, jaguars, lions, tigers, cheetahs etc."},{"kink_id":608,"name":"Fish \/ Sharks","description":"Gill-bearing aquatic animals such Great Whites, Tiger sharks, Whale sharks, and various types of fish."},{"kink_id":131,"name":"Humanoids","description":"Characters that have a humanoid shape but are not human. Examples may consist of various races such as satyrs, gnomes, dwarves, halflings, tieflings, etc."},{"kink_id":609,"name":"Humans","description":"Characters that are purely human, generally realistic, and generally contain no fantasy or supernatural elements (but not necessarily)."},{"kink_id":321,"name":"Hyaenidae","description":"Hyenas!"},{"kink_id":237,"name":"Insects \/ Arachnids","description":"Bees, wasps, spiders, scorpions, ants etc."},{"kink_id":516,"name":"Kemonomimi","description":"Characters with animal ears, a tail, or other animal characteristics on an otherwise human body."},{"kink_id":619,"name":"Lamia \/ Naga","description":"Characters with lower bodies (typically serpentine) that do not possess legs, with their lower extremities being more akin to a snake, eel, worm, fish, or similar."},{"kink_id":214,"name":"Lapines","description":"Bunnies, rabbits, hares etc."},{"kink_id":445,"name":"Lycanthropes","description":"A character with the ability and\/or condition to transform into an animal or particular non-human beast (generally an anthropomorphic animal or animal-like creature). Examples of such would be werewolves, werecats, and all forms of general werebeasts."},{"kink_id":224,"name":"Mammals","description":"Any character belonging to the Mammalia class."},{"kink_id":309,"name":"Marine Mammals","description":"Whales, dolphins, etc."},{"kink_id":322,"name":"Marsupials","description":"Kangaroos, koala, possums, wombats etc."},{"kink_id":323,"name":"Mephitis","description":"Skunks, basically!"},{"kink_id":529,"name":"Mollusca","description":"Slugs, snails, oysters, squids, octopuses, etc."},{"kink_id":613,"name":"Monkeys \/ Primates","description":"Apes, monkeys, chimps, gorillas, etc."},{"kink_id":483,"name":"Monsters","description":"Various types of monsters and aesthetically challenging characters."},{"kink_id":505,"name":"Moogles","description":"Moogles are a recurring race from the Final Fantasy computer games. They have small wings, usually pink \/ white fur and a pom-pom hanging from their heads."},{"kink_id":328,"name":"Mustelidae","description":"Minks, ferrets, weasels, stoats, otters, wolverines, martens etc."},{"kink_id":614,"name":"My Little Pony","description":"Characters from, or related to, the television show &ldquo;My Little Pony.&rdquo;"},{"kink_id":615,"name":"Orcs","description":"A race of humanlike creatures, normally larger than humans and green skinned. They are typically characterized as brutish and aggressive (but not necessarily so)."},{"kink_id":617,"name":"Parasites","description":"Expresses an interest in characters being infested with a parasitic organism or hosting one, or involving parasitic characters in general."},{"kink_id":249,"name":"Plants","description":"Any form of plant life, vegetation or character composed partially, or fully, there-of."},{"kink_id":504,"name":"Pok&eacute;mon","description":"Characters from the manga and television show &quot;Pokemon&quot;."},{"kink_id":424,"name":"Predator Species","description":"Expresses a preference for characters which are often perceived to be predatorial, e.g. wolves, hyenas, tigers, bears, dragons etc."},{"kink_id":425,"name":"Prey Species","description":"Expresses a preference for characters which are often perceived to be meek or preyed upon, e.g. mice, deer, raccoons, bunnies etc."},{"kink_id":325,"name":"Procyonidae","description":"Raccoons, coatimundi, longtails etc."},{"kink_id":225,"name":"Reptiles","description":"Chameleons, anoles, alligators, snakes, crocodiles, lizards, etc."},{"kink_id":161,"name":"Robots, Cyborgs, Androids","description":"Manufactured or partially manufactured life forms."},{"kink_id":283,"name":"Rodents \/ Murines","description":"Rats, mice, chipmunks, squirrels, etc."},{"kink_id":534,"name":"Sentient Cocks","description":"Expresses interest in cocks that are sentient. It might have the ability to twist and coil, move by itself, the external urethral orifice able to open and close at will, or be entirely stand alone without an attached &quot;host.&quot; May have a more serpent-like appearance."},{"kink_id":68,"name":"Taurs","description":"Characters having an upper torso adjoining a lower quadrupedal body where the creature&#039;s head should normally appear. Includes centaurs, chakats, etc."},{"kink_id":556,"name":"Undead","description":"The undead. Zombies, and other undead creatures."},{"kink_id":326,"name":"Ursines","description":"Bears! Bears! Bears!"},{"kink_id":182,"name":"Vampires","description":"Vampiric characters, not necessarily humanoid."},{"kink_id":213,"name":"Vulpines","description":"Foxes, fennecs, kitsune etc."},{"kink_id":281,"name":"Xeno \/ Alien","description":"Extraterrestrial or otherwise alien \/ abnormal characters."}]},"39":{"group":"Themes &amp; Settings","items":[{"kink_id":482,"name":"Adultery","description":"The act of voluntary sexual intercourse between a person and another character who is not their established spouse or partner."},{"kink_id":649,"name":"Affection","description":"The act of providing the sensations of tenderness and fondness, having characters express such feelings with one another through endearing behaviors."},{"kink_id":303,"name":"Babysitter","description":"A situation in which one character will either be or roleplay as another character&#039;s babysitter."},{"kink_id":650,"name":"Bad Ends","description":"A scenario where a character doesn&#039;t necessarily have to face death, but is presented with an unfortunate and inevitable future. May involve situations where a character is forced to submit to an undesired opposition or is trapped in a dangerous scenario where there is no escape."},{"kink_id":9,"name":"Competition","description":"Pertains to multiple dominants competing to administer domination the best, or multiple submissives competing to please a dominant the best."},{"kink_id":398,"name":"Consensual","description":"A preference for sexual interactions between characters in an RP to be fully consenting, by their characters&#039; own free wills."},{"kink_id":645,"name":"Cuckolding","description":"A scenario in which one partner is complicit in their partner&#039;s infidelity and derives sexual pleasure from it. Generally consists of watching their established partner have sexual relations with another individual, often where the other is considered to be &ldquo;better&rdquo; than them, but not necessarily."},{"kink_id":495,"name":"Dating","description":"Engaging in an RP where characters go on a date."},{"kink_id":657,"name":"Dub-Consensual","description":"Denotes sexual situations of &ldquo;dubious consent,&rdquo; where the receiver is either unwanting or uncertain, but struggles with the personal unsure conflict of secretly enjoying it."},{"kink_id":156,"name":"Exhibitionism","description":"Engaging in some kind of play where one or both parties will be caught, spotted, or otherwise observed by a third party or parties, adding to the thrill (and \/ or humiliation)."},{"kink_id":651,"name":"Fantasy","description":"Themes consisting of the fantasy genre, involving magic or other supernatural elements as a main plot element, theme, or setting. Magic and magical creatures are commonly incorporated."},{"kink_id":162,"name":"Fighting \/ Wrestling","description":"The act of physically sparring, either with malice or more playfully, with another character in an RP; typically non-sexual, although sometimes with the intent to pin the bottom or submissive in order to penetrate them."},{"kink_id":652,"name":"Horror","description":"Themes consisting of the horror genre, incorporating aspects that are considered creepy, macabre, scary, or unsettling (typically to elicit a physiological reaction) as a main plot element, theme, or setting."},{"kink_id":438,"name":"Humor \/ Comedy","description":"Expresses an interest in the inclusion of humorous dialogue, settings, or situations."},{"kink_id":127,"name":"Incest","description":"Engaging in an RP in which at least two characters will be related, either by blood or by marriage."},{"kink_id":646,"name":"Incest (Parental)","description":"Involves relationships where the characters are blood related in terms of being parent and child."},{"kink_id":647,"name":"Incest (Siblings)","description":"Involves relationships where the characters are blood related in terms of being siblings."},{"kink_id":124,"name":"Inexperienced Partners","description":"Refers to players whose characters are sexually inexperienced and \/ or naive (typically younger or virgin characters), or an interest in RPing with such characters; does not refer to the RPing capabilities of the player."},{"kink_id":497,"name":"Infantilism","description":"A scenario in which a character (be they adult or otherwise) will be treated as if they are exceptionally young; typically implies diaper wearing and \/ or diaper usage. Tends to include rather infantile themes and aspects."},{"kink_id":275,"name":"Informality","description":"Treating sexual acts, having explicit dialogue or reacting to predetermined kinks casually, or as if they were normal in their setting."},{"kink_id":121,"name":"Kidnapping","description":"The act of abducting a character in an RP, (typically for the purpose of abusing, usually sexually, but not necessarily) or being abducted for such reasons; often implies indefinite imprisonment."},{"kink_id":92,"name":"Medical Play","description":"Engaging in an RP set in a medical setting, such as a hospital, or an RP involving aspects of medicine, such as injections, medical equipment, uniforms or medical experiments or procedures."},{"kink_id":659,"name":"Military Themes","description":"Expresses an interest in scenes, settings, and themes that incorporate military aspects. Implies concepts such as war, weapon involvement, uniforms, rank, and more. All of which may be historical, fantasy, scifi or otherwise."},{"kink_id":719,"name":"Modern Settings","description":"Themes consisting of the modern aspects, taking place in current times. Often implies up to date technology and culture. "},{"kink_id":94,"name":"Multiple Partners","description":"Engaging in an RP containing at least three characters."},{"kink_id":413,"name":"Nightclubs \/ Bars","description":"Engaging in an RP which is set in a nightclub or a bar setting."},{"kink_id":100,"name":"Nonconsensual","description":"Engaging in an RP in which a character will be forced to give or receive sex against their will by another character."},{"kink_id":304,"name":"Parent and Child Play","description":"Describes a kind of relationship where the dominant assumes the role of a parent. This usually involves the dominant party being especially caring, nurturing and protective towards their sub. Conditioning and guidance are often involved as well."},{"kink_id":188,"name":"Photography \/ Videotaping","description":"The act of visually recording a scene amongst participants, often as a form of humiliation, exhibitionist fetishism and \/ or blackmail \/ extortion."},{"kink_id":653,"name":"Polyamory","description":"The practice of carrying out intimate relationships with more than one partner, with the knowledge and consent of all involved partners. Often described as &quot;consensual, ethical, and responsible non-monogamy.&quot;"},{"kink_id":153,"name":"Prostitution","description":"Engaging in an RP in which at least one player&#039;s character is a prostitute, or involves a prostitute; a person who receives money for sex."},{"kink_id":522,"name":"Pseudo-rape","description":"Arousal from a partner who pretends to resist and to struggle before being overpowered."},{"kink_id":574,"name":"Racism","description":"Scenes based on \/ including negative racial stereotypes, scenes in racist settings, differing treatment depending on a character&rsquo;s given race, and possible usage of derogatory terms in the context of a roleplay."},{"kink_id":518,"name":"Realism","description":"Expresses an interest in roleplaying scenes that are realistically possible by real life standards, or at the very least applying sensible logic and reason to situations, character responses, and motivations."},{"kink_id":430,"name":"Roleplay within RP","description":"Expresses an interest in two or more characters taking on roles within an RP and acting out a predetermined scene with predetermined characters."},{"kink_id":408,"name":"Role Reversal","description":"Refers to characters that, within the context of a particular RP, have, through character development or pre-determined measures, established their identity in regard to dominance and \/ or submissiveness, that will, at some point during the sexual portion of the RP, reverse their roles in regard to their previously understood roles."},{"kink_id":399,"name":"Romance","description":"Displaying or expressing love or strong affection, passion, either during love making or during normal scenes. Typically involves the roleplaying of romantic relationships, acts, and themes."},{"kink_id":267,"name":"Scenes - Dungeon","description":"Engaging in an RP which is set in a BDSM dungeon."},{"kink_id":268,"name":"Scenes - Laboratory","description":"Engaging in an RP in which the setting is of a laboratorial nature."},{"kink_id":489,"name":"Scenes - Locker Room","description":"Engaging in an RP in which the setting is a locker room."},{"kink_id":510,"name":"Scenes - Office","description":"Engaging in an RP which is set in an office."},{"kink_id":166,"name":"Scenes - School","description":"Engaging in an RP in which the setting is a school or college."},{"kink_id":443,"name":"Scenes - Shower \/ Bath","description":"Engaging in an RP in which the setting includes a bath or shower, may be public and \/ or shared."},{"kink_id":557,"name":"Scenes - Steampunk","description":"Setting in a roleplay where the main power source is steam. The time-period usually appearing as the 19th century, yet containing fantasy \/ futuristic elements, inventions, and machines often way ahead of it&#039;s time."},{"kink_id":524,"name":"Scenes - Tribal","description":"Engaging in an RP set in a tribal village or wild area, located far from civilization."},{"kink_id":654,"name":"Sci-fi","description":"Themes of the science-fiction genre, typically dealing with imaginative concepts such as futuristic science and technology, space travel, time travel, extraterrestrial life, and so on."},{"kink_id":573,"name":"Sexism","description":"Scenes based on prejudices, stereotypes, or discrimination on the basis of sex or gender, including sexist settings."},{"kink_id":655,"name":"Slice of Life","description":"Engaging in scenes of seemingly arbitrary events in a character&#039;s life, often lacking plot development and left open ended. Usually consists of naturally occurring themes and narratives that are of the casual and mundane variety."},{"kink_id":407,"name":"Small Dom \/ Big Sub","description":"Expresses an interest in the bottom \/ submissive character being physically larger than the top \/ dominant character in an RP; often implies the larger character is also physically stronger as well."},{"kink_id":648,"name":"Speciesism","description":"Scenes that incorporate addressing another species in a derogatory manner, usually demeaning epithets and \/ or claiming superiority to another species in the context of a roleplay."},{"kink_id":656,"name":"STDs","description":"Expresses an interest in play that incorporates sexually transmitted diseases, be they ones of real world origin or entirely fictional."},{"kink_id":83,"name":"Very Experienced Partners","description":"Refers to players whose characters are exceptionally experienced and \/ or skilled in the practice of sex, and typically connotates esoteric sexual abilities and \/ or knowledge, or the interest in RPing with such characters; does not refer to the RPing capabilities of the player."},{"kink_id":89,"name":"Voyeurism","description":"Participating in watching other individuals engaging in sex or some other kind of intercourse, usually discretely and without their knowledge."},{"kink_id":658,"name":"Weapon Play","description":"Expresses an interest in the incorporation of weaponry, such as knives, swords, guns, and various other armaments."},{"kink_id":547,"name":"World of Warcraft","description":"Roleplay taking place in the World of Warcraft universe."},{"kink_id":218,"name":"Zoophilia","description":"Refers to a sapient character engaging in a sexual act with a non-sapient animal, or playing a non-sapient animal in an RP and being engaged by a sapient character."}]},"47":{"group":"Transformation","items":[{"kink_id":696,"name":"Animal Transformation","description":"Transforming a character into an animal creature, typically quadrupedal but not necessarily, may some varying degree of sentience or feral mindedness."},{"kink_id":575,"name":"Bimbofication","description":"Scenes in which someone is turned into a stereotypical bimbo, often including breast growth, intelligence-reduction, increased sex drive, and more subtle change to features such as hair-color or general appearance."},{"kink_id":698,"name":"Body Part Transformation","description":"Transforming a character into a body part, or into a part of another character&#039;s body, may be done through a variety of means."},{"kink_id":701,"name":"Body Swapping","description":"The act of two or more individuals swapping bodies through consciousness transfer, enabling them to inhabit the other&#039;s body."},{"kink_id":528,"name":"Gender Transformation","description":"Transforming a character into another gender by various means, which may or may not include their sex. Encompasses both magical and sci-fi changes, as well as more realistic gender reassignment."},{"kink_id":697,"name":"Inanimate Object Transformation","description":"Transforming a character into an object of sorts (a chair, clothing, a toy, etc.), may be done through a variety of means."},{"kink_id":699,"name":"Species Transformation","description":"Transforming a character into another species other than their own, may be done through a variety of means."},{"kink_id":700,"name":"Supernatural Transformation","description":"Transforming a character into a supernatural entity such as a vampire, werebeast, demon, god, and other such varied mythical figures. May be done through a variety of means."},{"kink_id":179,"name":"Transformation","description":"The act of causing the physical characteristics of a participant of an RP, possibly including one&#039;s self, by magical or chemical means, to change in a dramatic fashion; may refer to a myriad of different types of transformations, and connotates receiving sexual pleasure from the act of transformation itself."}]},"50":{"group":"Unclean Themes &amp; Play","items":[{"kink_id":709,"name":"Belching \/ Burping","description":"Belching, during sexual intercourse, or just as an act during the roleplay. May be exaggerated (visible expulsions of air) and \/ or with exaggerated burping noises, but not necessarily."},{"kink_id":706,"name":"Dirty Feet","description":"Expresses an interest in feet that are deemed &ldquo;unclean,&rdquo; usually through sweat, dirt, or a buildup of grime."},{"kink_id":335,"name":"Extreme Musk","description":"Engaging in an RP in which one character exudes exceptionally strong odors from the body, such as but not limited to odor from the crotch, foreskin, feet or armpit to degrees that are typically realistic and \/ or derived from excessive lack of hygiene."},{"kink_id":549,"name":"Farting","description":"Farting, during sexual intercourse, or just as an act during the roleplay. May be exaggerated (visible expulsions of air) and \/ or with exaggerated flatulent noises, but not necessarily."},{"kink_id":707,"name":"Filth","description":"Expresses an interest in the inclusion of dirtiness and uncleanly aspects such as foul odors, trash, or any other form of physical matter that is considered unsanitary or disgusting."},{"kink_id":87,"name":"Messy","description":"Engaging in an RP that may involve excessive amounts of liquids (which may be bodily fluids) or other solutions such as (but not limited to) mud, food, slime, etc."},{"kink_id":570,"name":"Slob","description":"Characters without hygiene or uncaring of typical standards for cleanliness due to laziness, personal choice, or otherwise; may emphasize and derive pleasure from laziness or from actions linked with a lack of hygiene."},{"kink_id":708,"name":"Smegma","description":"Expresses an interest in the build-up substance that generates on one&#039;s genitals (typically under foreskin and labia) due to a lack of maintained hygiene."},{"kink_id":560,"name":"Swallowing Vomit","description":"Engaging in an RP in which a character will orally consume vomit."},{"kink_id":705,"name":"Unwashed Musk","description":"Refers to an RP involving characters where the aspect of unwashed musk is notably present \/ involved in play. Generally implies one or more characters having a distinct scent due to a lack of hygiene (typically with pheromones derived from the crotch)."},{"kink_id":184,"name":"Vomiting","description":"The act of vomiting, being vomited upon, consuming vomit or otherwise including vomit in the sexual context of an RP."}]},"33":{"group":"Vaginal Sex &amp; Play","items":[{"kink_id":18,"name":"Cervical Penetration","description":"Engaging in sex that involves the penetration, by the penis or by another object, of a cervix; typically connotes exceptionally rough sex or exceptionally large insertions."},{"kink_id":715,"name":"Clit Play","description":"Play that is centered around the clitoris, applying stimulation and significant attention, usually as a form of achieving orgasm. "},{"kink_id":625,"name":"Fingering (Vaginal)","description":"The act of using one&rsquo;s fingers to stimulate another&rsquo;s vagina, or receiving such actions, in order to induce sexual pleasure, commonly resulting in orgasm."},{"kink_id":499,"name":"Gaping (Vaginal)","description":"Stretching the vagina during penetration, to the point that it stays open for a period of time."},{"kink_id":159,"name":"Pussy Worship","description":"Gratuitous acknowledgment of one&#039;s partner&#039;s vagina, either verbal and \/ or physical, or receiving such actions; typically implies oral stimulation."},{"kink_id":316,"name":"Queefing","description":"The sounds of air expulsion from the vagina via intercourse."},{"kink_id":200,"name":"Squirting","description":"The act of a vagina emitting a projectile fluid during orgasm."},{"kink_id":548,"name":"Tribadism \/ Scissoring","description":"Form of non-penetrative sex in which a person rubs their vagina against a same-sex partner&#039;s body for sexual stimulation, in most cases vaginal-to-vaginal contact through scissoring."},{"kink_id":76,"name":"Vaginal Fisting","description":"The act of placing one&#039;s hand(s) and \/ or arm(s) into a vagina, or receiving such actions."},{"kink_id":721,"name":"Vaginal Prolapse","description":"Where insides of the vagina are pulled out by force (unnatural means, such as a cream, liquid or suction method, or internal massage) or naturally (either by a cock, dildo, or pushing)."},{"kink_id":229,"name":"Vaginal Sex (Giving)","description":"The act of sexually penetrating a vagina."},{"kink_id":340,"name":"Vaginal Sex (Receiving)","description":"The act of being sexually penetrated in the vagina."},{"kink_id":81,"name":"Vaginal Virginity","description":"Engaging in vaginal sex with a character who has never been vaginally penetrated before, or being vaginally penetrated while playing a character that has never been penetrated before."}]},"49":{"group":"Vore &amp; Unbirth","items":[{"kink_id":239,"name":"Absorption","description":"Vore by means of merging with the predator, or being absorbed and \/ or dissolved by an anatomical fluid of the predator."},{"kink_id":244,"name":"Alternative Vore","description":"The act of physically consuming another character, performed through an orifice other than the mouth, penis, vagina or anus, or receiving such actions."},{"kink_id":209,"name":"Anal Vore","description":"Vore where something or someone is swallowed into the anus."},{"kink_id":714,"name":"Cannibalism","description":"The act of consuming same \/ similar species, usually of the humanoid variety and intelligent. Typically denotes realism and a character being realistically eaten. "},{"kink_id":208,"name":"Cock Vore","description":"The act of physically consuming another character, performed through the penis, often resulting in the prey character being lodged into the testicles, or being the recipient of such actions."},{"kink_id":716,"name":"Cooking (Vore)","description":"The act of a character cooking \/ preparing a character (or being cooked \/ prepared) to be consumed by another. May involve a character whole or just parts of a character. Tends to involve the act of realistically preparing someone in the same way one would cook a traditional meal."},{"kink_id":238,"name":"Digestion","description":"Engaging in a vore-related RP in which the prey character will be digested in whatever fluid(s) are applicable."},{"kink_id":241,"name":"Disposal","description":"Engaging in a vore-related RP in which the prey will be consumed, digested and released as fecal matter and \/ or urine."},{"kink_id":66,"name":"Hard Vore","description":"Engaging in vore in which the prey character is chewed and \/ or eaten piece by piece, or otherwise physically mutilated by the act of being consumed."},{"kink_id":242,"name":"Realistic Vore","description":"Engaging in a vore scene in which realistic physiology is taken into account; typically connotates hard vore."},{"kink_id":73,"name":"Soft Vore","description":"Engaging in vore in which the prey character is consumed whole, causing no or minimal damage to the character due to the vore process."},{"kink_id":210,"name":"Unbirthing","description":"The act of physically consuming another character through the vagina and into the womb, or being the recipient of such actions."},{"kink_id":243,"name":"Unrealistic Vore","description":"Engaging in a vore scene in which realistic physiology is not taken into account; typically connotates soft vore."},{"kink_id":422,"name":"Vore (Being Predator)","description":"Being the consuming partner in a vore or unbirth situation, acting as the predator."},{"kink_id":423,"name":"Vore (Being Prey)","description":"Being the consumed partner in a vore-related RP situation."}]},"51":{"group":"Watersports &amp; Scat","items":[{"kink_id":43,"name":"Bathroom Control","description":"A situation in which a character controls when, how and where another character may use the bathroom in any fashion, typically as a form of control or degradation."},{"kink_id":415,"name":"Hyper Scat","description":"Producing unnatural amounts of feces, or using other means to obtain feces in huge, often unrealistic, amounts within an RP, the excretion of product thereof causing sexual stimulation and \/ or distress to one or more characters."},{"kink_id":414,"name":"Hyper Watersports","description":"Producing unnatural amounts of urine, or using other means to obtain urine in huge, often unrealistic, amounts within an RP, the excretion of product thereof causing sexual stimulation and \/ or distress to one or more characters."},{"kink_id":368,"name":"Marking","description":"The act of urinating on another character in order to mark them with your proprietary scent of urine, or being the recipient of such actions."},{"kink_id":533,"name":"Piss Enemas","description":"The act of performing an enema, the liquid being used in such being urine, or receiving such actions, often by means of someone urinating inside their partner."},{"kink_id":164,"name":"Scat","description":"Pertains to the inclusion of fecal matter or the expelling of fecal matter in any form in the sexual context of an RP."},{"kink_id":369,"name":"Scat Torture","description":"The act of using fecal matter or the act of expelling fecal matter to abuse another character who is unwilling or uninterested in taking part in such actions, or being the recipient of such."},{"kink_id":509,"name":"Soiling","description":"The act of &quot;fecal soiling&quot; in one&#039;s underwear, pants or clothes, or having another character perform such actions."},{"kink_id":201,"name":"Swallowing Feces","description":"Engaging in an RP in which a character will orally consume fecal matter."},{"kink_id":203,"name":"Swallowing Urine","description":"Engaging in an RP in which a character will orally consume urine."},{"kink_id":59,"name":"Watersports","description":"Pertains to the inclusion of urine, or the expelling of urine, in any form, in the sexual context of an RP."},{"kink_id":371,"name":"Wetting","description":"The act of urinating in one&#039;s underwear, pants or clothes, or having another character urinate onto a person who is clothed to any degree."}]}},"error":""}